{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from pathlib import Path\n",
    "from zipfile import ZipFile\n",
    "\n",
    "from mimesis import Person\n",
    "from mimesis.locales import Locale\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "DUMMY_DATA_DIR = Path(\"assets/dummy_data\")\n",
    "\n",
    "BOOK_TABEL_FILENAME = \"books_df.csv\"\n",
    "\n",
    "USER_TABEL_FILENAME = \"users_df.csv\"\n",
    "\n",
    "RATING_TABEL_FILNAME = \"ratings_df.csv\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "DATA_DIR = Path(\"assets/books.zip\")\n",
    "\n",
    "with ZipFile(DATA_DIR) as z:\n",
    "    files = (file for file in z.namelist() if Path(file).suffix == \".csv\")\n",
    "    data = {Path(file).stem.lower(): pd.read_csv(z.extract(file),low_memory=False) for file in files}\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ISBN</th>\n",
       "      <th>Book-Title</th>\n",
       "      <th>Book-Author</th>\n",
       "      <th>Year-Of-Publication</th>\n",
       "      <th>Publisher</th>\n",
       "      <th>Image-URL-S</th>\n",
       "      <th>Image-URL-M</th>\n",
       "      <th>Image-URL-L</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>221332</th>\n",
       "      <td>0517571684</td>\n",
       "      <td>Mary Emmerling's American Country Classics: Th...</td>\n",
       "      <td>Mary Ellisor Emmerling</td>\n",
       "      <td>1990</td>\n",
       "      <td>Rutland Group</td>\n",
       "      <td>http://images.amazon.com/images/P/0517571684.0...</td>\n",
       "      <td>http://images.amazon.com/images/P/0517571684.0...</td>\n",
       "      <td>http://images.amazon.com/images/P/0517571684.0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124140</th>\n",
       "      <td>0449134164</td>\n",
       "      <td>The House Guests (Gm)</td>\n",
       "      <td>John D. MacDonald</td>\n",
       "      <td>1973</td>\n",
       "      <td>Fawcett Books</td>\n",
       "      <td>http://images.amazon.com/images/P/0449134164.0...</td>\n",
       "      <td>http://images.amazon.com/images/P/0449134164.0...</td>\n",
       "      <td>http://images.amazon.com/images/P/0449134164.0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45771</th>\n",
       "      <td>0553212834</td>\n",
       "      <td>Four Tragedies: Hamlet, Othello, King Lear, Ma...</td>\n",
       "      <td>William Shakespeare</td>\n",
       "      <td>1988</td>\n",
       "      <td>Bantam</td>\n",
       "      <td>http://images.amazon.com/images/P/0553212834.0...</td>\n",
       "      <td>http://images.amazon.com/images/P/0553212834.0...</td>\n",
       "      <td>http://images.amazon.com/images/P/0553212834.0...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              ISBN                                         Book-Title  \\\n",
       "221332  0517571684  Mary Emmerling's American Country Classics: Th...   \n",
       "124140  0449134164                              The House Guests (Gm)   \n",
       "45771   0553212834  Four Tragedies: Hamlet, Othello, King Lear, Ma...   \n",
       "\n",
       "                   Book-Author Year-Of-Publication      Publisher  \\\n",
       "221332  Mary Ellisor Emmerling                1990  Rutland Group   \n",
       "124140       John D. MacDonald                1973  Fawcett Books   \n",
       "45771      William Shakespeare                1988         Bantam   \n",
       "\n",
       "                                              Image-URL-S  \\\n",
       "221332  http://images.amazon.com/images/P/0517571684.0...   \n",
       "124140  http://images.amazon.com/images/P/0449134164.0...   \n",
       "45771   http://images.amazon.com/images/P/0553212834.0...   \n",
       "\n",
       "                                              Image-URL-M  \\\n",
       "221332  http://images.amazon.com/images/P/0517571684.0...   \n",
       "124140  http://images.amazon.com/images/P/0449134164.0...   \n",
       "45771   http://images.amazon.com/images/P/0553212834.0...   \n",
       "\n",
       "                                              Image-URL-L  \n",
       "221332  http://images.amazon.com/images/P/0517571684.0...  \n",
       "124140  http://images.amazon.com/images/P/0449134164.0...  \n",
       "45771   http://images.amazon.com/images/P/0553212834.0...  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data.get(\"books\").sample(3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_14838/2223040320.py:26: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_ratings_df.loc[:, 'Rating_cat'] = rating_cat\n",
      "/tmp/ipykernel_14838/2223040320.py:59: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_users_df.loc[:, 'User-Name'] = filtered_users_df[\"User-ID\"].map(id_to_name)\n",
      "/tmp/ipykernel_14838/2223040320.py:60: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_users_df.loc[:, 'AgeGroup'] = age_group\n",
      "/tmp/ipykernel_14838/2223040320.py:26: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_ratings_df.loc[:, 'Rating_cat'] = rating_cat\n"
     ]
    }
   ],
   "source": [
    "def generate_names(unique_ids: set[str]) -> dict[str, str]:\n",
    "    \n",
    "    \"\"\"Generate Fake Names matching unique ids\n",
    "    \"\"\"\n",
    "    number_of_ids = len(unique_ids)\n",
    "    person = Person(Locale.DA)\n",
    "    unique_names = set()\n",
    "\n",
    "    # Generate the specified number of female names\n",
    "    while len(unique_names) < number_of_ids:\n",
    "        name = person.full_name()\n",
    "        unique_names.add(name)\n",
    "\n",
    "    return {id:name for id, name in zip(unique_ids, unique_names)}\n",
    "\n",
    "\n",
    "def filter_ratings(data, num_samples=40, random_state=40):\n",
    "    ratings_df = data['ratings']\n",
    "    books_list = ratings_df.sample(num_samples, random_state=random_state).ISBN.to_list()\n",
    "    filtered_ratings_df = ratings_df[ratings_df['ISBN'].isin(books_list)]\n",
    "\n",
    "    bins = [0, 5, 10]\n",
    "    labels = [\"Did Not Like\", 'Liked']\n",
    "    rating_cat = pd.cut(filtered_ratings_df[\"Book-Rating\"], bins=bins, labels=labels, right=False)\n",
    "\n",
    "    filtered_ratings_df.loc[:, 'Rating_cat'] = rating_cat\n",
    "    filtered_ratings_df.loc[:, 'ISBN'] = filtered_ratings_df[\"ISBN\"].replace(\"0440514428\",\"038531258X\") # mistake in data\n",
    "    filtered_ratings_df.to_csv(f\"{DUMMY_DATA_DIR}/{RATING_TABEL_FILNAME}\", index=False)\n",
    "    return filtered_ratings_df\n",
    "\n",
    "def generate_name_mapping(unique_ids):\n",
    "    id_to_name = generate_names(unique_ids=unique_ids)\n",
    "    return id_to_name\n",
    "\n",
    "def generate_random_numbers_and_age_groups(size):\n",
    "    np.random.seed(0)\n",
    "    random_numbers = np.random.normal(loc=50, scale=20, size=size)\n",
    "    random_numbers = np.clip(random_numbers, 8, 90)\n",
    "\n",
    "    bins = [0, 11, 18, 25, 55, 110]\n",
    "    labels = ['Kid', 'Teen', 'Young Adult', 'Adult', 'Old Person']\n",
    "    age_group = pd.cut(random_numbers, bins=bins, labels=labels, right=False)\n",
    "    age = random_numbers.round()\n",
    "\n",
    "    return age_group, age\n",
    "\n",
    "def generate_user_data(data):\n",
    "    users_df = data[\"users\"]\n",
    "    ratings_df = filter_ratings(data)\n",
    "    users_list = ratings_df[\"User-ID\"].to_list()\n",
    "\n",
    "    filtered_users_df = users_df[users_df[\"User-ID\"].isin(users_list)]\n",
    "\n",
    "    unique_ids = filtered_users_df[\"User-ID\"].unique()\n",
    "    id_to_name = generate_name_mapping(unique_ids)\n",
    "\n",
    "    age_group, age = generate_random_numbers_and_age_groups(len(filtered_users_df))\n",
    "\n",
    "    filtered_users_df.loc[:, 'User-Name'] = filtered_users_df[\"User-ID\"].map(id_to_name)\n",
    "    filtered_users_df.loc[:, 'AgeGroup'] = age_group\n",
    "    filtered_users_df.loc[:, 'Age'] = age\n",
    "\n",
    "    filtered_users_df.to_csv(f\"{DUMMY_DATA_DIR}/{USER_TABEL_FILENAME}\", index=False)\n",
    "    return filtered_users_df\n",
    "\n",
    "def process_books_data(data, preprocessed_users_df):\n",
    "    books_df = data[\"books\"][['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher']]\n",
    "    filtered_ratings_df = filter_ratings(data)\n",
    "\n",
    "    books_df = books_df[books_df['ISBN'].isin(filtered_ratings_df[\"ISBN\"].tolist())]\n",
    "    \n",
    "    # Define a list of genres\n",
    "    genres = ['Mystery', 'Science Fiction', 'Romance', 'Fantasy', 'Thriller']\n",
    "    \n",
    "    # Add a 'Genre' column with randomly assigned genres\n",
    "    books_df['Genre'] = np.random.choice(genres, size=len(books_df))\n",
    "    books_df.to_csv(f\"{DUMMY_DATA_DIR}/{BOOK_TABEL_FILENAME}\", index=False)\n",
    "    return books_df\n",
    "\n",
    "filtered_users_df = generate_user_data(data)\n",
    "processed_books_df = process_books_data(data, filtered_users_df)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "import duckdb\n",
    "\n",
    "key_1 = \"ISBN\"\n",
    "key_2 = \"User-ID\"\n",
    "\n",
    "# Create a new table and insert the results of the JOIN query into it\n",
    "duckdb.sql(\n",
    "    f\"\"\"\n",
    "    CREATE TABLE joined_table AS\n",
    "    SELECT *\n",
    "    FROM \"{DUMMY_DATA_DIR}/{RATING_TABEL_FILNAME}\" AS ratings\n",
    "    JOIN \"{DUMMY_DATA_DIR}/{BOOK_TABEL_FILENAME}\" AS books ON (books.{key_1} = ratings.{key_1})\n",
    "    JOIN \"{DUMMY_DATA_DIR}/{USER_TABEL_FILENAME}\" AS users ON (users.\"{key_2}\" = ratings.\"{key_2}\")\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',\n",
       "       'Genre', 'User-ID', 'User-Name', 'Book-Rating', 'Rating_cat',\n",
       "       'Location', 'Age', 'AgeGroup'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Select the data from the newly created table\n",
    "dataf = duckdb.sql(\n",
    "    \"\"\"\n",
    "    SELECT ISBN, \"Book-Title\", \"Book-Author\", \"Year-Of-Publication\", Publisher, Genre, \"User-ID\", \"User-Name\",\n",
    "            \"Book-Rating\", \"Rating_cat\" ,Location, Age, AgeGroup\n",
    "    FROM joined_table\n",
    "    \"\"\"\n",
    ").df()#.sample(500)\n",
    "dataf.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "from ast import literal_eval\n",
    "import json\n",
    "# from decouple import config \".py\n",
    "from decouple import AutoConfig # notebooks\n",
    "import duckdb\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "from mimesis import Person\n",
    "from mimesis.locales import Locale\n",
    "\n",
    "from neomodel import (config as cf,\n",
    "                      db,\n",
    "                      StructuredNode,\n",
    "                      StringProperty,\n",
    "                      StructuredRel,\n",
    "                      DateTimeProperty,\n",
    "                      RelationshipTo,\n",
    "                      RelationshipFrom,\n",
    "                      UniqueIdProperty,\n",
    "                      FloatProperty,\n",
    "\n",
    "\n",
    ")\n",
    "\n",
    "from neomodel.contrib.spatial_properties import PointProperty, NeomodelPoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "cf.AUTO_INSTALL_LABELS = True\n",
    "cf.ENCRYPTED_CONNECTION = False\n",
    "\n",
    "#NEO4J_BOLT_URL=\"bolt://neo4j:metterocks@localhost:7687\"\n",
    "db.set_connection(\"bolt://neo4j:metterocks@localhost:7687\")\n",
    "\n",
    "db._NODE_CLASS_REGISTRY\n",
    "db._NODE_CLASS_REGISTRY = {}\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], [])"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#delete all nodes\n",
    "db.cypher_query(\n",
    "\"MATCH (n) DETACH DELETE n\"\n",
    ")\n",
    "\n",
    "#delete all nodes and relationships\n",
    "db.cypher_query(\n",
    "\"MATCH () <- [n] - () DELETE n\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " + Creating node unique constraint for title on label Book for class __main__.Book\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=18, name='constraint_unique_Book_title', type='UNIQUENESS', schema=(:Book {title}), ownedIndex=17 )'.}\n",
      " + Creating node unique constraint for author on label Book for class __main__.Book\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=22, name='constraint_unique_Book_author', type='UNIQUENESS', schema=(:Book {author}), ownedIndex=21 )'.}\n",
      " + Creating node unique constraint for isbn on label Book for class __main__.Book\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=10, name='constraint_unique_Book_isbn', type='UNIQUENESS', schema=(:Book {isbn}), ownedIndex=9 )'.}\n",
      " + Creating node unique constraint for uid on label User for class __main__.User\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=12, name='constraint_unique_User_uid', type='UNIQUENESS', schema=(:User {uid}), ownedIndex=11 )'.}\n",
      " + Creating node unique constraint for name on label Author for class __main__.Author\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=16, name='constraint_unique_Author_name', type='UNIQUENESS', schema=(:Author {name}), ownedIndex=15 )'.}\n",
      " + Creating node unique constraint for name on label Genre for class __main__.Genre\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=20, name='constraint_unique_Genre_name', type='UNIQUENESS', schema=(:Genre {name}), ownedIndex=19 )'.}\n"
     ]
    }
   ],
   "source": [
    "class global_values(StructuredRel):\n",
    "   average_rating  = FloatProperty()\n",
    "   typical_num_ratings = FloatProperty()\n",
    "\n",
    "class Rated(StructuredRel):\n",
    "    rating = FloatProperty()\n",
    "\n",
    "class Book(StructuredNode):\n",
    "    title = StringProperty(unique_index=True)\n",
    "    author = StringProperty(unique_index=True)\n",
    "    genre = StringProperty(required=True)\n",
    "    isbn = UniqueIdProperty()\n",
    "\n",
    "    written_by = RelationshipTo('Author', 'WRITTEN_BY')\n",
    "    belongs_to = RelationshipTo('Genre', 'BELONGS_TO')\n",
    "    rated_by = RelationshipTo('User', 'RATED', model=Rated)  # Add this line\n",
    "\n",
    "\n",
    "class AgeGroup(StructuredNode):\n",
    "    age = StringProperty(required=True)\n",
    "\n",
    "class User(StructuredNode):\n",
    "    uid = UniqueIdProperty()\n",
    "    name = StringProperty(required=True)\n",
    "\n",
    "    read = RelationshipTo('Book', 'READ')\n",
    "    is_in = RelationshipTo('AgeGroup', 'IS_IN')\n",
    "    liked = RelationshipTo('Book', 'LIKED')\n",
    "    hate = RelationshipTo('Book', 'HATE')\n",
    "    rated = RelationshipTo('Book', 'RATED', model=Rated)  # Add this line\n",
    "\n",
    "\n",
    "class Author(StructuredNode):\n",
    "    name = StringProperty(unique_index=True)\n",
    "\n",
    "class Genre(StructuredNode):\n",
    "    name = StringProperty(unique_index=True)\n",
    "     "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# a = Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',\n",
    "#        'Genre', 'User-ID', 'Book-Rating', 'Location', 'Age', 'AgeGroup'],\n",
    "#       dtype='object')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# USERS\n",
    "for user_name, user_id in (dataf[[\"User-Name\", 'User-ID']]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "    User(name=user_name, uid=user_id).save()\n",
    "\n",
    "# BOOKS\n",
    "for book_title, isbn, book_author, book_genre in (dataf[[\"Book-Title\", \"ISBN\", \"Book-Author\", \"Genre\"]]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "\n",
    "):\n",
    "    Book(title=book_title, uid=isbn, author=book_author, genre=book_genre).save()\n",
    "\n",
    "# AUTHORS\n",
    "for book_author in (dataf[\"Book-Author\"]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "    Author(name=book_author).save()\n",
    "\n",
    "# AGEGROUPS\n",
    "for age_group in (dataf[\"AgeGroup\"]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "    AgeGroup(age=age_group).save()\n",
    "\n",
    "# Genres\n",
    "for genre in (dataf[\"Genre\"]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "    Genre(name=genre).save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "for book_title, author_name, user_id, age_group_value, genre_name, rating in dataf[[\"Book-Title\", \"Book-Author\", \"User-ID\", \"AgeGroup\", \"Genre\", \"Book-Rating\"]].drop_duplicates().values.tolist():\n",
    "    # Find all matching books, authors, users, age groups, and genres\n",
    "    books = Book.nodes.filter(title=book_title)\n",
    "    authors = Author.nodes.filter(name=author_name)\n",
    "    users = User.nodes.filter(uid=user_id)\n",
    "    ages = AgeGroup.nodes.filter(age=age_group_value)\n",
    "    genres = Genre.nodes.filter(name=genre_name)\n",
    "\n",
    "    # Create relationships between books and authors, books and genres\n",
    "    for book_node in books:\n",
    "        for author_node in authors:\n",
    "            book_node.written_by.connect(author_node)\n",
    "\n",
    "        for genre_node in genres:\n",
    "            book_node.belongs_to.connect(genre_node)\n",
    "\n",
    "    # Create relationships between users and books (read and rated), users and age groups\n",
    "    for user_node in users:\n",
    "        for book_node in books:\n",
    "            # Connect read relationship\n",
    "            user_node.read.connect(book_node)\n",
    "\n",
    "            # Connect rated relationship, assuming a 'Rated' relationship class exists\n",
    "            user_node.rated.connect(book_node, {'rating': rating})\n",
    "\n",
    "        #for age_node in ages:\n",
    "            #user_node.is_in.connect(age_node)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_like = dataf[dataf[\"Rating_cat\"]==\"Liked\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "for book_title, user_id, in df_like[[\"Book-Title\", \"User-ID\"]].drop_duplicates().values.tolist():\n",
    "    books = Book.nodes.filter(title=book_title)\n",
    "    users = User.nodes.filter(uid=user_id)\n",
    "    \n",
    "    for book_node in books:\n",
    "        for user_node in users:\n",
    "            user_node.liked.connect(book_node)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[<Node element_id='4:e178d927-297a-4570-8eae-8af6f2348cf6:17547' labels=frozenset({'GlobalValues'}) properties={'typical_num_ratings': 42, 'average_rating': 2.8495934959349594, 'id': 1}>]],\n",
       " ['g'])"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate Global values used for statistics\n",
    "db.cypher_query(\n",
    "    \"\"\"\n",
    "    // Calculate global values\n",
    "    MATCH (book:Book)<-[r:RATED]-(:User)\n",
    "    WITH COUNT(r) AS TotalRatings, SUM(r.rating) AS SumRatings\n",
    "    MATCH (book:Book)\n",
    "    WITH TotalRatings, SumRatings, COUNT(book) AS TotalBooks\n",
    "\n",
    "    // Now carry forward the global values for the Bayesian calculation\n",
    "    WITH SumRatings / TotalRatings AS GlobalAverageRating, TotalRatings / TotalBooks AS TypicalNumRatings\n",
    "\n",
    "    // Create or update the GlobalValues node\n",
    "    MERGE (g:GlobalValues {id: 1})\n",
    "    SET g.average_rating = GlobalAverageRating, g.typical_num_ratings = TypicalNumRatings\n",
    "    RETURN g\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[\"Big Stone Gap: A Novel (Ballantine Reader's Circle)\",\n",
       "   3.791208791208791,\n",
       "   182,\n",
       "   3.614655923344948],\n",
       "  ['How to Lose Friends &amp; Alienate People', 4.5, 20, 3.3819826907946497],\n",
       "  ['The Witching Hour (Lives of the Mayfair Witches)',\n",
       "   4.096774193548387,\n",
       "   31,\n",
       "   3.3792181757434014],\n",
       "  ['What Looks Like Crazy On An Ordinary Day',\n",
       "   3.4739336492890995,\n",
       "   211,\n",
       "   3.370288248337029],\n",
       "  ['Meeting Luciano (Ballantine Readers Circle)', 4.5, 10, 3.1669793621013134],\n",
       "  ['The Dice Man', 4.428571428571429, 7, 3.0751617720258837],\n",
       "  [\"Santa's Holiday Treats: A Wilton Book of Recipes &amp; Ideas\",\n",
       "   8.0,\n",
       "   1,\n",
       "   2.9693703913783325],\n",
       "  ['TELECOSM: How Infinite Bandwidth will Revolutionize Our World',\n",
       "   3.6666666666666665,\n",
       "   6,\n",
       "   2.9517276422764227],\n",
       "  ['Astrotherapy: Astrology and the Realization of the Self (Arkana S.)',\n",
       "   7.0,\n",
       "   1,\n",
       "   2.946114577424844],\n",
       "  ['Middlesex: A Novel', 2.972477064220184, 109, 2.938297528670651],\n",
       "  ['A Place of Execution', 2.9615384615384612, 52, 2.911520498183705],\n",
       "  ['The Evidence Exposed', 3.0555555555555562, 18, 2.9113821138211384],\n",
       "  ['Eli', 2.9545454545454546, 22, 2.885670731707317],\n",
       "  ['The Temple of Dawn (The Sea of Fertility, 3)',\n",
       "   3.2500000000000004,\n",
       "   4,\n",
       "   2.8844114528101805],\n",
       "  ['The Songcatcher: A Ballad Novel',\n",
       "   2.8730158730158726,\n",
       "   63,\n",
       "   2.863646922183507],\n",
       "  ['Nisa: The Life and Words of a !Kung Woman',\n",
       "   2.6363636363636362,\n",
       "   11,\n",
       "   2.805338242061666],\n",
       "  ['Wild Innocence (Something Wild) Man Of The Month (Silhouette Desire, No 835)',\n",
       "   0.0,\n",
       "   1,\n",
       "   2.7833238797504256],\n",
       "  [\"Robert Asprin &amp; Lynn Abbey's Thieves' World Graphics (Thieves' World Graphics)\",\n",
       "   0.0,\n",
       "   1,\n",
       "   2.7833238797504256],\n",
       "  ['The Ultimate Disney Trivia Book 3 : 999 New Questions! (Ultimate Disney Trivia Book)',\n",
       "   0.0,\n",
       "   1,\n",
       "   2.7833238797504256],\n",
       "  ['10-Minute Scrapbook Pages: Hundreds of Easy, Innovative Designs',\n",
       "   0.0,\n",
       "   1,\n",
       "   2.7833238797504256],\n",
       "  ['Das Volk der Stille.', 0.0, 1, 2.7833238797504256],\n",
       "  ['Fatherland', 2.0, 4, 2.7757158006362674],\n",
       "  ['A Good House', 2.4545454545454546, 11, 2.7676023930050624],\n",
       "  ['Saint Maybe', 2.727272727272728, 99, 2.763708700916797],\n",
       "  ['The Fall of Yugoslavia: The Third Balkan War', 0.0, 2, 2.720066518847007],\n",
       "  ['Trading Places', 2.5689655172413794, 58, 2.686829268292683],\n",
       "  ['SAVAGES', 1.75, 8, 2.673658536585366],\n",
       "  ['Family Album: A Mellingham Mystery', 0.0, 3, 2.6596205962059623],\n",
       "  ['AbgrÃ?Â¼ndig.', 1.0, 5, 2.652828230409964],\n",
       "  ['Meditations for Women Who Do Too Much - 10th Anniversary',\n",
       "   2.342857142857143,\n",
       "   35,\n",
       "   2.6192587899904973],\n",
       "  ['This Montana Home (Family Man) (Harlequin Superromance, No 692)',\n",
       "   2.130434782608696,\n",
       "   23,\n",
       "   2.5951219512195123],\n",
       "  ['Call of the Wild', 2.355555555555555, 180, 2.4490221929246316],\n",
       "  ['Dianetics: The Modern Science of Mental Health: A Handbook of Dianetics Procedure',\n",
       "   1.4210526315789471,\n",
       "   19,\n",
       "   2.404638144742103],\n",
       "  ['The Key to Midnight', 2.0666666666666664, 105, 2.2903600464576073],\n",
       "  ['K Is for Killer (Kinsey Millhone Mysteries (Paperback))',\n",
       "   2.105263157894737,\n",
       "   171,\n",
       "   2.2520325203252036]],\n",
       " ['BookTitle', 'AverageRating', 'TotalRatings', 'book.BayesianAverage'])"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculating Bayasian Average Rating for ench Book\n",
    "\n",
    "db.cypher_query(\n",
    "    \"\"\"\n",
    "    // Match the GlobalValues node and carry forward its properties\n",
    "    MATCH (g:GlobalValues)\n",
    "    WITH g.average_rating AS GlobalAverageRating, g.typical_num_ratings AS TypicalNumRatings\n",
    "\n",
    "    // Calculate Bayesian average for each book and set it as a property\n",
    "    MATCH (book:Book)<-[r:RATED]-(:User)\n",
    "    WITH book, AVG(r.rating) AS AverageRating, COUNT(r) AS TotalRatings, GlobalAverageRating, TypicalNumRatings\n",
    "    SET book.BayesianAverage = ((TypicalNumRatings * GlobalAverageRating) + (AverageRating * TotalRatings)) / (TypicalNumRatings + TotalRatings)\n",
    "    RETURN book.title AS BookTitle, AverageRating, TotalRatings, book.BayesianAverage\n",
    "    ORDER BY book.BayesianAverage DESC\n",
    "    \"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# book_ratings = db.cypher_query(\n",
    "# \"\"\"\n",
    "# // Calculate global values\n",
    "# MATCH (book:Book)<-[r:RATED]-(:User)\n",
    "# WITH COUNT(r) AS TotalRatings, SUM(r.rating) AS SumRatings\n",
    "# MATCH (book:Book)\n",
    "# WITH TotalRatings, SumRatings, COUNT(book) AS TotalBooks\n",
    "\n",
    "# // Now carry forward the global values for the Bayesian calculation\n",
    "# WITH SumRatings / TotalRatings AS GlobalAverageRating, TotalRatings / TotalBooks AS TypicalNumRatings, TotalRatings\n",
    "\n",
    "# // Calculate Bayesian average for each book and set it as a property\n",
    "# MATCH (book:Book)<-[r:RATED]-(:User)\n",
    "# WITH book, AVG(r.rating) AS AverageRating, COUNT(r) AS TotalRatings, GlobalAverageRating, TypicalNumRatings\n",
    "# SET book.BayesianAverage = ((TypicalNumRatings * GlobalAverageRating) + (AverageRating * TotalRatings)) / (TypicalNumRatings + TotalRatings)\n",
    "# RETURN book.title AS BookTitle, AverageRating, TotalRatings, book.BayesianAverage\n",
    "# ORDER BY book.BayesianAverage DESC\n",
    "# \"\"\"\n",
    "# )\n",
    "# ratings_df = pd.DataFrame(book_ratings[0], columns=[\"BookTitle\",\"AverageRating\", \"TotalRatings\", \"BayesianAverage\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "author_ratings = db.cypher_query(\n",
    "\"\"\"\n",
    "// Calculate global values\n",
    "MATCH (book:Book)<-[r:RATED]-(:User)\n",
    "WITH COUNT(r) AS TotalRatings, SUM(r.rating) AS SumRatings\n",
    "MATCH (book:Book)\n",
    "WITH TotalRatings, SumRatings, COUNT(book) AS TotalBooks\n",
    "\n",
    "// Now carry forward the global values for the Bayesian calculation\n",
    "WITH SumRatings / TotalRatings AS GlobalAverageRating, TotalRatings / TotalBooks AS TypicalNumRatings\n",
    "\n",
    "// Calculate Bayesian average for each author and set it as a property\n",
    "MATCH (author:Author)<-[:WRITTEN_BY]-(book:Book)<-[r:RATED]-(:User)\n",
    "WITH author, AVG(r.rating) AS AverageRating, COUNT(r) AS TotalRatings, GlobalAverageRating, TypicalNumRatings\n",
    "SET author.BayesianAverage = ((TypicalNumRatings * GlobalAverageRating) + (AverageRating * TotalRatings)) / (TypicalNumRatings + TotalRatings)\n",
    "RETURN author.name AS AuthorName, AverageRating, TotalRatings, author.BayesianAverage\n",
    "ORDER BY author.BayesianAverage DESC\n",
    "\"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_random_user_name():\n",
    "        result = db.cypher_query(\n",
    "            \"\"\"\n",
    "            MATCH (user:User)\n",
    "            WITH COLLECT(user.name) AS names\n",
    "            RETURN apoc.coll.randomItem(names) AS RandomUserName\n",
    "        \"\"\")\n",
    "        return result[0][0][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Inga Korsholm'"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "USER_NAME = get_random_user_name()\n",
    "USER_NAME"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['What Looks Like Crazy On An Ordinary Day',\n",
       " 'Saint Maybe',\n",
       " 'Call of the Wild',\n",
       " 'Nisa: The Life and Words of a !Kung Woman',\n",
       " 'Trading Places',\n",
       " \"Big Stone Gap: A Novel (Ballantine Reader's Circle)\"]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "USER_NAME = get_random_user_name()\n",
    "book_list = db.cypher_query(\n",
    "    \"\"\"\n",
    "    MATCH (userA:User {name: $USER_NAME})-[:LIKED]->(sharedBook:Book)<-[:LIKED]-(otherUser:User)\n",
    "    WHERE userA <> otherUser\n",
    "    WITH DISTINCT otherUser\n",
    "    MATCH (otherUser)-[:LIKED]->(book:Book)\n",
    "    WITH DISTINCT book\n",
    "    RETURN COLLECT(book.title) AS UniqueBooksReadByOthers\n",
    "    \"\"\",\n",
    "    params={\"USER_NAME\": USER_NAME}\n",
    ")[0][0][0]\n",
    "book_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'CASE': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"AS\"\n  \"CALL\"\n  \"CONTAINS\"\n  \"CREATE\"\n  \"DELETE\"\n  \"DETACH\"\n  \"ENDS\"\n  \"FOREACH\"\n  \"IN\"\n  \"IS\"\n  \"LIMIT\"\n  \"LOAD\"\n  \"MATCH\"\n  \"MERGE\"\n  \"OPTIONAL\"\n  \"OR\"\n  \"ORDER\"\n  \"REMOVE\"\n  \"RETURN\"\n  \"SET\"\n  \"SKIP\"\n  \"STARTS\"\n  \"UNION\"\n  \"UNWIND\"\n  \"USE\"\n  \"WHERE\"\n  \"WITH\"\n  \"XOR\"\n  \"^\"\n  <EOF> (line 7, column 6 (offset: 275))\n\"     CASE WHEN sharedBooks.genre = otherBooks.genre THEN otherBooks.BayesianAverage * 100 ELSE otherBooks.BayesianAverage END AS Score\"\n      ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "\u001b[1;32m/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb Cell 24\u001b[0m line \u001b[0;36m1\n\u001b[0;32m----> <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=0'>1</a>\u001b[0m db\u001b[39m.\u001b[39;49mcypher_query(\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=1'>2</a>\u001b[0m \u001b[39m\"\"\"\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=2'>3</a>\u001b[0m \u001b[39mMATCH (userA:User {name: $USER_NAME})-[:LIKED]->(sharedBooks:Book)<-[:LIKED]-(otherUser:User)\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=3'>4</a>\u001b[0m \u001b[39mWITH DISTINCT otherUser, sharedBooks \u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=4'>5</a>\u001b[0m \u001b[39mMATCH (otherUser) -[:LIKED]->(otherBooks:Book) //-[]->(g:Genre)\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=5'>6</a>\u001b[0m \u001b[39mWHERE sharedBooks <> otherBooks\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=6'>7</a>\u001b[0m \u001b[39mWITH sharedBooks.genre, otherBooks.genre\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=7'>8</a>\u001b[0m \u001b[39m     CASE WHEN sharedBooks.genre = otherBooks.genre THEN otherBooks.BayesianAverage * 100 ELSE otherBooks.BayesianAverage END AS Score\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=8'>9</a>\u001b[0m \u001b[39mRETURN otherBook.title AS RecTitle, Score\u001b[39;49;00m\n\u001b[1;32m     <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=9'>10</a>\u001b[0m \n\u001b[1;32m     <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=10'>11</a>\u001b[0m \u001b[39m//RETURN otherBooks.title AS BookTitle, otherBooks.BayesianAverage AS BayesianAvg, otherBooks.genre AS Genre, sharedBooks.genre, g.name AS readBook_Genre //, collect(DISTINCT sharedBooks.title, )\u001b[39;49;00m\n\u001b[1;32m     <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=11'>12</a>\u001b[0m \u001b[39m\"\"\"\u001b[39;49;00m,\n\u001b[1;32m     <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=12'>13</a>\u001b[0m     params\u001b[39m=\u001b[39;49m{\u001b[39m\"\u001b[39;49m\u001b[39mUSER_NAME\u001b[39;49m\u001b[39m\"\u001b[39;49m: USER_NAME}\n\u001b[1;32m     <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y111sdnNjb2RlLXJlbW90ZQ%3D%3D?line=13'>14</a>\u001b[0m )\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neomodel/util.py:39\u001b[0m, in \u001b[0;36mensure_connection.<locals>.wrapper\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m     36\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mnot\u001b[39;00m _db\u001b[39m.\u001b[39murl:\n\u001b[1;32m     37\u001b[0m     _db\u001b[39m.\u001b[39mset_connection(config\u001b[39m.\u001b[39mDATABASE_URL)\n\u001b[0;32m---> 39\u001b[0m \u001b[39mreturn\u001b[39;00m func(\u001b[39mself\u001b[39;49m, \u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neomodel/util.py:382\u001b[0m, in \u001b[0;36mDatabase.cypher_query\u001b[0;34m(self, query, params, handle_unique, retry_on_session_expire, resolve_objects)\u001b[0m\n\u001b[1;32m    377\u001b[0m \u001b[39melse\u001b[39;00m:\n\u001b[1;32m    378\u001b[0m     \u001b[39m# Otherwise create a new session in a with to dispose of it after it has been run\u001b[39;00m\n\u001b[1;32m    379\u001b[0m     \u001b[39mwith\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mdriver\u001b[39m.\u001b[39msession(\n\u001b[1;32m    380\u001b[0m         database\u001b[39m=\u001b[39m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_database_name, impersonated_user\u001b[39m=\u001b[39m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mimpersonated_user\n\u001b[1;32m    381\u001b[0m     ) \u001b[39mas\u001b[39;00m session:\n\u001b[0;32m--> 382\u001b[0m         results, meta \u001b[39m=\u001b[39m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_run_cypher_query(\n\u001b[1;32m    383\u001b[0m             session,\n\u001b[1;32m    384\u001b[0m             query,\n\u001b[1;32m    385\u001b[0m             params,\n\u001b[1;32m    386\u001b[0m             handle_unique,\n\u001b[1;32m    387\u001b[0m             retry_on_session_expire,\n\u001b[1;32m    388\u001b[0m             resolve_objects,\n\u001b[1;32m    389\u001b[0m         )\n\u001b[1;32m    391\u001b[0m \u001b[39mreturn\u001b[39;00m results, meta\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neomodel/util.py:420\u001b[0m, in \u001b[0;36mDatabase._run_cypher_query\u001b[0;34m(self, session, query, params, handle_unique, retry_on_session_expire, resolve_objects)\u001b[0m\n\u001b[1;32m    418\u001b[0m         \u001b[39mraise\u001b[39;00m ConstraintValidationFailed(e\u001b[39m.\u001b[39mmessage) \u001b[39mfrom\u001b[39;00m \u001b[39me\u001b[39;00m\n\u001b[1;32m    419\u001b[0m     exc_info \u001b[39m=\u001b[39m sys\u001b[39m.\u001b[39mexc_info()\n\u001b[0;32m--> 420\u001b[0m     \u001b[39mraise\u001b[39;00m exc_info[\u001b[39m1\u001b[39m]\u001b[39m.\u001b[39mwith_traceback(exc_info[\u001b[39m2\u001b[39m])\n\u001b[1;32m    421\u001b[0m \u001b[39mexcept\u001b[39;00m SessionExpired:\n\u001b[1;32m    422\u001b[0m     \u001b[39mif\u001b[39;00m retry_on_session_expire:\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neomodel/util.py:405\u001b[0m, in \u001b[0;36mDatabase._run_cypher_query\u001b[0;34m(self, session, query, params, handle_unique, retry_on_session_expire, resolve_objects)\u001b[0m\n\u001b[1;32m    402\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[1;32m    403\u001b[0m     \u001b[39m# Retrieve the data\u001b[39;00m\n\u001b[1;32m    404\u001b[0m     start \u001b[39m=\u001b[39m time\u001b[39m.\u001b[39mtime()\n\u001b[0;32m--> 405\u001b[0m     response \u001b[39m=\u001b[39m session\u001b[39m.\u001b[39;49mrun(query, params)\n\u001b[1;32m    406\u001b[0m     results, meta \u001b[39m=\u001b[39m [\u001b[39mlist\u001b[39m(r\u001b[39m.\u001b[39mvalues()) \u001b[39mfor\u001b[39;00m r \u001b[39min\u001b[39;00m response], response\u001b[39m.\u001b[39mkeys()\n\u001b[1;32m    407\u001b[0m     end \u001b[39m=\u001b[39m time\u001b[39m.\u001b[39mtime()\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/work/session.py:317\u001b[0m, in \u001b[0;36mSession.run\u001b[0;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[1;32m    315\u001b[0m bookmarks \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_get_bookmarks()\n\u001b[1;32m    316\u001b[0m parameters \u001b[39m=\u001b[39m \u001b[39mdict\u001b[39m(parameters \u001b[39mor\u001b[39;00m {}, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs)\n\u001b[0;32m--> 317\u001b[0m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_auto_result\u001b[39m.\u001b[39;49m_run(\n\u001b[1;32m    318\u001b[0m     query, parameters, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mdatabase,\n\u001b[1;32m    319\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mimpersonated_user, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mdefault_access_mode,\n\u001b[1;32m    320\u001b[0m     bookmarks, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mnotifications_min_severity,\n\u001b[1;32m    321\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mnotifications_disabled_categories,\n\u001b[1;32m    322\u001b[0m )\n\u001b[1;32m    324\u001b[0m \u001b[39mreturn\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_auto_result\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/work/result.py:166\u001b[0m, in \u001b[0;36mResult._run\u001b[0;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[1;32m    164\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_pull()\n\u001b[1;32m    165\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_connection\u001b[39m.\u001b[39msend_all()\n\u001b[0;32m--> 166\u001b[0m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_attach()\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/work/result.py:274\u001b[0m, in \u001b[0;36mResult._attach\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    272\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_exhausted \u001b[39mis\u001b[39;00m \u001b[39mFalse\u001b[39;00m:\n\u001b[1;32m    273\u001b[0m     \u001b[39mwhile\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_attached \u001b[39mis\u001b[39;00m \u001b[39mFalse\u001b[39;00m:\n\u001b[0;32m--> 274\u001b[0m         \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_connection\u001b[39m.\u001b[39;49mfetch_message()\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/io/_common.py:180\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    178\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39minner\u001b[39m(\u001b[39m*\u001b[39margs, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs):\n\u001b[1;32m    179\u001b[0m     \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 180\u001b[0m         func(\u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n\u001b[1;32m    181\u001b[0m     \u001b[39mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[39mas\u001b[39;00m exc:\n\u001b[1;32m    182\u001b[0m         \u001b[39massert\u001b[39;00m \u001b[39mnot\u001b[39;00m asyncio\u001b[39m.\u001b[39miscoroutinefunction(\u001b[39mself\u001b[39m\u001b[39m.\u001b[39m__on_error)\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/io/_bolt.py:826\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    822\u001b[0m \u001b[39m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m    823\u001b[0m tag, fields \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39minbox\u001b[39m.\u001b[39mpop(\n\u001b[1;32m    824\u001b[0m     hydration_hooks\u001b[39m=\u001b[39m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mresponses[\u001b[39m0\u001b[39m]\u001b[39m.\u001b[39mhydration_hooks\n\u001b[1;32m    825\u001b[0m )\n\u001b[0;32m--> 826\u001b[0m res \u001b[39m=\u001b[39m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_process_message(tag, fields)\n\u001b[1;32m    827\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39midle_since \u001b[39m=\u001b[39m perf_counter()\n\u001b[1;32m    828\u001b[0m \u001b[39mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/io/_bolt5.py:370\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[0;34m(self, tag, fields)\u001b[0m\n\u001b[1;32m    368\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_server_state_manager\u001b[39m.\u001b[39mstate \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mbolt_states\u001b[39m.\u001b[39mFAILED\n\u001b[1;32m    369\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 370\u001b[0m     response\u001b[39m.\u001b[39;49mon_failure(summary_metadata \u001b[39mor\u001b[39;49;00m {})\n\u001b[1;32m    371\u001b[0m \u001b[39mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[1;32m    372\u001b[0m     \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mpool:\n",
      "File \u001b[0;32m~/.cache/pypoetry/virtualenvs/hive-SFGWpxVe-py3.10/lib/python3.10/site-packages/neo4j/_sync/io/_common.py:247\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    245\u001b[0m handler \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mhandlers\u001b[39m.\u001b[39mget(\u001b[39m\"\u001b[39m\u001b[39mon_summary\u001b[39m\u001b[39m\"\u001b[39m)\n\u001b[1;32m    246\u001b[0m Util\u001b[39m.\u001b[39mcallback(handler)\n\u001b[0;32m--> 247\u001b[0m \u001b[39mraise\u001b[39;00m Neo4jError\u001b[39m.\u001b[39mhydrate(\u001b[39m*\u001b[39m\u001b[39m*\u001b[39mmetadata)\n",
      "\u001b[0;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'CASE': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"AS\"\n  \"CALL\"\n  \"CONTAINS\"\n  \"CREATE\"\n  \"DELETE\"\n  \"DETACH\"\n  \"ENDS\"\n  \"FOREACH\"\n  \"IN\"\n  \"IS\"\n  \"LIMIT\"\n  \"LOAD\"\n  \"MATCH\"\n  \"MERGE\"\n  \"OPTIONAL\"\n  \"OR\"\n  \"ORDER\"\n  \"REMOVE\"\n  \"RETURN\"\n  \"SET\"\n  \"SKIP\"\n  \"STARTS\"\n  \"UNION\"\n  \"UNWIND\"\n  \"USE\"\n  \"WHERE\"\n  \"WITH\"\n  \"XOR\"\n  \"^\"\n  <EOF> (line 7, column 6 (offset: 275))\n\"     CASE WHEN sharedBooks.genre = otherBooks.genre THEN otherBooks.BayesianAverage * 100 ELSE otherBooks.BayesianAverage END AS Score\"\n      ^}"
     ]
    }
   ],
   "source": [
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (userA:User {name: $USER_NAME})-[:LIKED]->(sharedBooks:Book)<-[:LIKED]-(otherUser:User)\n",
    "WITH DISTINCT otherUser, sharedBooks \n",
    "MATCH (otherUser) -[:LIKED]->(otherBooks:Book) //-[]->(g:Genre)\n",
    "WHERE sharedBooks <> otherBooks\n",
    "WITH sharedBooks.genre, otherBooks.genre\n",
    "     CASE WHEN sharedBooks.genre = otherBooks.genre THEN otherBooks.BayesianAverage * 100 ELSE otherBooks.BayesianAverage END AS Score\n",
    "RETURN otherBook.title AS RecTitle, Score\n",
    "\n",
    "//RETURN otherBooks.title AS BookTitle, otherBooks.BayesianAverage AS BayesianAvg, otherBooks.genre AS Genre, sharedBooks.genre, g.name AS readBook_Genre, Score //, collect(DISTINCT sharedBooks.title, )\n",
    "\"\"\",\n",
    "    params={\"USER_NAME\": USER_NAME}\n",
    ")\n",
    "\n",
    "WITH otherBooks.title AS RecTitle, otherBooks.BayesianAverage AS initialScore,\n",
    "     CASE WHEN SharedBookGenre = OtherBookGenre \n",
    "          THEN otherBooks.BayesianAverage * 100 \n",
    "          ELSE otherBooks.BayesianAverage \n",
    "     END AS Score"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Marten Højlund'"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "USER_NAME"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'ratings_df' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb Cell 26\u001b[0m line \u001b[0;36m2\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y100sdnNjb2RlLXJlbW90ZQ%3D%3D?line=0'>1</a>\u001b[0m \u001b[39m# Filter the DataFrame\u001b[39;00m\n\u001b[0;32m----> <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y100sdnNjb2RlLXJlbW90ZQ%3D%3D?line=1'>2</a>\u001b[0m filtered_df \u001b[39m=\u001b[39m ratings_df[ratings_df[\u001b[39m'\u001b[39m\u001b[39mBookTitle\u001b[39m\u001b[39m'\u001b[39m]\u001b[39m.\u001b[39misin(book_list)]\u001b[39m.\u001b[39mreset_index()\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y100sdnNjb2RlLXJlbW90ZQ%3D%3D?line=3'>4</a>\u001b[0m \u001b[39m# Display the filtered DataFrame\u001b[39;00m\n\u001b[1;32m      <a href='vscode-notebook-cell://wsl%2Bubuntu/home/mette/projects/hadithi/dev.io/notebooks/graph.ipynb#Y100sdnNjb2RlLXJlbW90ZQ%3D%3D?line=4'>5</a>\u001b[0m filtered_df\u001b[39m.\u001b[39mhead(\u001b[39m10\u001b[39m)\n",
      "\u001b[0;31mNameError\u001b[0m: name 'ratings_df' is not defined"
     ]
    }
   ],
   "source": [
    "# Filter the DataFrame\n",
    "filtered_df = ratings_df[ratings_df['BookTitle'].isin(book_list)].reset_index()\n",
    "\n",
    "# Display the filtered DataFrame\n",
    "filtered_df.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "MATCH (userA:User {name: 'Gunnur Grønkjær'})-[:LIKED]->(sharedBooks:Book)<-[:LIKED]-(otherUser:User)\n",
    "WITH DISTINCT otherUser, sharedBooks \n",
    "MATCH (otherUser) -[:LIKED]->(otherBooks:Book) -[]->(g:Genre)\n",
    "WHERE sharedBooks <> otherBooks\n",
    "RETURN otherBooks.title AS recTitle, otherBooks.BayesianAverage AS BayesianAvg\n",
    ", otherBooks.genre AS Genre, sharedBooks.genre, g.name //, collect(DISTINCT sharedBooks.title, )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def calculate_bayesian_average(data):\n",
    "    # Creating DataFrame\n",
    "    df = pd.DataFrame(data[0], columns=[\"item\", \"avg_rating\", \"num_ratings\"])\n",
    "\n",
    "    # Calculate global average rating (M) and typical number of ratings per book (C)\n",
    "    global_average_rating = df['avg_rating'].mean()\n",
    "    print(\"global_average_rating\", global_average_rating)\n",
    "    typical_num_ratings = df['num_ratings'].mean()\n",
    "    print(\"typical_num_ratings\", typical_num_ratings)\n",
    "    # Apply Bayesian average formula to each book\n",
    "    df['BayesianAverage'] = ((typical_num_ratings * global_average_rating) + (df['avg_rating'] * df['num_ratings'])) / (typical_num_ratings + df['num_ratings'])\n",
    "    \n",
    "    # Sort the DataFrame by BayesianAverage and then convert to dictionary\n",
    "    sorted_df = df.sort_values(by='BayesianAverage', ascending=False)\n",
    "    bayesian_average_dict = sorted_df.set_index('item')['BayesianAverage'].to_dict()\n",
    "    \n",
    "    return bayesian_average_dict\n",
    "#"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "book_ratings = db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (book:Book)<-[r:RATED]-(:User)\n",
    "WITH book.title AS BookTitle, AVG(r.rating) AS AverageRating, COUNT(r) AS TotalRatings\n",
    "RETURN BookTitle, AverageRating, TotalRatings\n",
    "ORDER BY BookTitle\n",
    "\"\"\"\n",
    ")\n",
    "# Calculate Bayesian averages\n",
    "bayesian_df = calculate_bayesian_average(data=book_ratings)\n",
    "bayesian_df\n",
    "df = pd.DataFrame(book_ratings[0], columns=[\"item\", \"avg_rating\", \"num_ratings\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "genre_ratings = db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (genre:Genre)<-[:BELONGS_TO]-(book:Book)<-[r:RATED]-(:User)\n",
    "WITH genre.name AS GenreName, AVG(r.rating) AS AverageRating, COUNT(r) AS TotalRatings\n",
    "RETURN GenreName, AverageRating, TotalRatings\n",
    "ORDER BY GenreName\n",
    "\"\"\"\n",
    ")\n",
    "# Calculate Bayesian averages\n",
    "bayesian_df = calculate_bayesian_average(data=genre_ratings)\n",
    "bayesian_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "author_ratings = db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (author:Author)<-[:WRITTEN_BY]-(book:Book)<-[r:RATED]-(:User)\n",
    "WITH author.name AS AuthorName, AVG(r.rating) AS AverageRating, COUNT(r) AS TotalRatings\n",
    "RETURN AuthorName, AverageRating, TotalRatings\n",
    "ORDER BY AuthorName\n",
    "\n",
    "\"\"\"\n",
    ")\n",
    "# Calculate Bayesian averages\n",
    "bayesian_df = calculate_bayesian_average(data=author_ratings)\n",
    "bayesian_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_random_user_name():\n",
    "        result = db.cypher_query(\n",
    "            \"\"\"\n",
    "            MATCH (user:User)\n",
    "            WITH COLLECT(user.name) AS names\n",
    "            RETURN apoc.coll.randomItem(names) AS RandomUserName\n",
    "        \"\"\")\n",
    "        return result[0][0][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "USER_NAME = get_random_user_name()\n",
    "USER_NAME"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "USER_NAME"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "book_list = db.cypher_query(\n",
    "    \"\"\"\n",
    "    MATCH (userA:User {name: $USER_NAME})-[:LIKED]->(sharedBook:Book)\n",
    "    MATCH (otherUser:User)-[:READ]->(sharedBook)\n",
    "    WHERE userA <> otherUser\n",
    "    WITH DISTINCT otherUser\n",
    "    MATCH (otherUser)-[:LIKED]->(book:Book)\n",
    "    WITH DISTINCT book\n",
    "    RETURN COLLECT(book.title) AS UniqueBooksReadByOthers\n",
    "    \"\"\",\n",
    "    params={\"USER_NAME\": USER_NAME}\n",
    ")[0][0][0]\n",
    "book_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Existing dictionary from calculate_bayesian_average function\n",
    "bayesian_average_dict = calculate_bayesian_average(data=book_ratings)  # Assuming data is already defined\n",
    "\n",
    "# Filter the dictionary to keep only the keys present in filter_list\n",
    "filtered_dict = {key: val for key, val in bayesian_average_dict.items() if key in book_list}\n",
    "df_user = pd.DataFrame(list(filtered_dict.items()), columns=['BookTitle', 'Score'])\n",
    "\n",
    "df_user"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Calculate average reads per book\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "// Step 1: Calculate total reads and book count for each genre\n",
    "MATCH (book:Book)\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH COUNT(DISTINCT read) AS Reads, COUNT(DISTINCT book) AS BookCount\n",
    "            MATCH (book:Book)\n",
    "            SET book.AverageReadsPerBook = Reads/BookCount\n",
    "RETURN Reads/BookCount AS AverageReadsPerBook\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Calculate total reads and book count for each genre\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "// Step 1: Calculate total reads and book count for each genre\n",
    "MATCH (genre:Genre)<-[:BELONGS_TO]-(book:Book)\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH genre, COUNT(DISTINCT book) AS BookCount, COUNT(DISTINCT read) AS Reads\n",
    "\n",
    "// Step 2: Calculate the average reads per book for each genre\n",
    "WITH genre, Reads, BookCount, CASE WHEN BookCount > 0 THEN toFloat(Reads) / BookCount ELSE 0 END AS AverageReadsPerBook\n",
    "\n",
    "// Step 3: Update the genre nodes with the calculated average\n",
    "SET genre.AverageReadsPerBook = AverageReadsPerBook\n",
    "RETURN genre.name AS Genre, Reads, BookCount, genre.AverageReadsPerBook\n",
    "ORDER BY genre.AverageReadsPerBook DESC\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Calculate total reads and book count for each author\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "// Step 1: Calculate total reads and book count for each author\n",
    "MATCH (author:Author)-[:WRITTEN_BY]-(book:Book)\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH author, COUNT(DISTINCT book) AS BookCount, COUNT(DISTINCT read) AS Reads\n",
    "\n",
    "// Step 2: Calculate the average reads per book for each author\n",
    "WITH author, Reads, BookCount, CASE WHEN BookCount > 0 THEN toFloat(Reads) / BookCount ELSE 0 END AS AverageReadsPerBook\n",
    "\n",
    "// Step 3: Update the author nodes with the calculated average\n",
    "SET author.AverageReadsPerBook = AverageReadsPerBook\n",
    "RETURN author.name AS Author, Reads, BookCount, author.AverageReadsPerBook\n",
    "\"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# set book likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH book, COUNT(DISTINCT like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH book, Likes, COUNT(DISTINCT hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH book, Likes, Hates, COUNT(DISTINCT read) AS Reads\n",
    "WITH book, Likes, Hates, Reads, \n",
    "     CASE \n",
    "         WHEN Reads > 0 THEN ROUND(100 * ((book.AverageReadsPerBook * 0.5) + toFloat(Likes)) / (book.AverageReadsPerBook + toFloat(Likes))) / 100 \n",
    "         ELSE 0 \n",
    "     END AS LikeReadRatio\n",
    "SET book.likeability = LikeReadRatio\n",
    "RETURN book.title AS BookTitle, \n",
    "       Likes AS LikesBook, \n",
    "       Hates AS HatesBook, \n",
    "       Reads AS TotalReactionsBook,\n",
    "       LikeReadRatio AS LikeReadRatioBook\n",
    "    ORDER BY LikeReadRatio DESC\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# set genre likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (genre:Genre)<-[:BELONGS_TO]-(book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH genre, book, COUNT(like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH genre, book, Likes, COUNT(hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH genre, book, Likes, Hates, COUNT(read) AS Reads\n",
    "WITH genre, COLLECT({book: book.title, likes: Likes, hates: Hates, reads: Reads}) AS Books\n",
    "UNWIND Books AS bookDetails\n",
    "WITH genre, \n",
    "     SUM(bookDetails.likes) AS TotalLikes, \n",
    "     SUM(bookDetails.hates) AS TotalHates,\n",
    "     SUM(bookDetails.reads) AS TotalReads\n",
    "WITH genre, TotalLikes, TotalHates, TotalReads,\n",
    "     CASE \n",
    "         WHEN TotalReads > 0 \n",
    "         THEN ROUND(100 * ((genre.AverageReadsPerBook * 0.5) + toFloat(TotalLikes)) / (genre.AverageReadsPerBook + toFloat(TotalLikes))) / 100 \n",
    "         ELSE 0 \n",
    "     END AS LikeReadRatio\n",
    "SET genre.likeability = LikeReadRatio\n",
    "RETURN genre.name AS Genre, \n",
    "       TotalLikes AS TotalLikesGenre, \n",
    "       TotalHates AS TotalHatesGenre,\n",
    "       TotalReads AS TotalReadsGenre,\n",
    "       LikeReadRatio AS LikeReadRatioGenre\n",
    "ORDER BY LikeReadRatio DESC\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# set author likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "       \"\"\"\n",
    "MATCH (author:Author)<-[:WRITTEN_BY]-(book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH author, book, COUNT(DISTINCT like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH author, book, Likes, COUNT(DISTINCT hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH author, book, Likes, Hates, COUNT(DISTINCT read) AS Reads\n",
    "WITH author, SUM(Likes) AS TotalLikes, SUM(Hates) AS TotalHates, SUM(Reads) AS TotalReads\n",
    "WITH author, TotalLikes, TotalHates, TotalReads,\n",
    "     CASE \n",
    "         WHEN TotalReads > 0 \n",
    "         THEN ROUND(100 * (author.AverageReadsPerBook * toFloat(TotalLikes)) / (author.AverageReadsPerBook + toFloat(TotalLikes))) / 100 \n",
    "         ELSE 0\n",
    "     END AS LikeReadRatio\n",
    "SET author.likeability = LikeReadRatio\n",
    "RETURN author.name AS AuthorName, \n",
    "       TotalLikes AS TotalLikesAuthor, \n",
    "       TotalHates AS TotalHatesAuthor,\n",
    "       TotalReads AS TotalReadsAuthor,\n",
    "       LikeReadRatio AS LikeReadRatioAuthor\n",
    "// Add an ORDER BY clause if needed, for example:\n",
    "// ORDER BY LikeReadRatioAuthor DESC\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # set book likeability propperty\n",
    "\n",
    "# db.cypher_query(\n",
    "# \"\"\"\n",
    "# MATCH (book:Book)\n",
    "# OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "# WITH book, COUNT(DISTINCT like) AS Likes\n",
    "# OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "# WITH book, Likes, COUNT(DISTINCT hate) AS Hates\n",
    "# OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "# WITH book, Likes, Hates, COUNT(DISTINCT read) AS Reads\n",
    "# WITH book, Likes, Hates, Reads, \n",
    "#      ROUND(100 * CASE WHEN Reads > 0 THEN toFloat(Likes) / Reads ELSE 0 END) / 100 AS LikeReadRatio\n",
    "# SET book.likeability = LikeReadRatio\n",
    "# RETURN book.title AS BookTitle, \n",
    "#        Likes, \n",
    "#        Hates, \n",
    "#        (Likes + Hates) AS TotalReactions,\n",
    "#        LikeReadRatio\n",
    "# \"\"\"\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# set UserAuthor likeability propperty\n",
    "mapper = 2\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (user:User)-[:READ]->(book)-[:WRITTEN_BY]->(author:Author)\n",
    "OPTIONAL MATCH (user)-[like:LIKED]->(book)\n",
    "OPTIONAL MATCH (user)-[hate:HATE]->(book)\n",
    "WITH user, author, \n",
    "     COUNT(DISTINCT like) AS Likes, \n",
    "     COUNT(DISTINCT hate) AS Hates\n",
    "WITH user, \n",
    "     COLLECT({\n",
    "       author: author.name, \n",
    "       likeRatio: CASE \n",
    "                    WHEN (Likes + Hates) > 0 \n",
    "                    THEN ROUND((100 * toFloat(Likes) / (Likes + Hates)) * $mapper) / 100 \n",
    "                    ELSE 0 \n",
    "                  END\n",
    "     }) AS AuthorLikeRatios\n",
    "SET user.authorLikeRatios = apoc.convert.toJson(AuthorLikeRatios)\n",
    "\"\"\",\n",
    "params={\"mapper\": mapper}\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# set UserGenre likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (user:User)-[:READ]->(book)-[:BELONGS_TO]->(genre:Genre)\n",
    "OPTIONAL MATCH (user)-[like:LIKED]->(book)\n",
    "OPTIONAL MATCH (user)-[hate:HATE]->(book)\n",
    "WITH user, genre, \n",
    "     COUNT(DISTINCT like) AS Likes, \n",
    "     COUNT(DISTINCT hate) AS Hates\n",
    "WITH user, \n",
    "     COLLECT({genre: genre.name, likeRatio: CASE \n",
    "             WHEN (Likes + Hates) > 0 THEN ROUND((100 * toFloat(Likes) / (Likes + Hates)) * $mapper) / 100 \n",
    "             ELSE 0 \n",
    "         END}) AS GenreLikeRatios\n",
    "SET user.genreLikeRatios = apoc.convert.toJson(GenreLikeRatios)\n",
    "\"\"\",\n",
    "params={\"mapper\": mapper}\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# bookscore for new user\n",
    "\n",
    "data = db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (book:Book)-[:BELONGS_TO]->(genre:Genre)\n",
    "MATCH (book)-[:WRITTEN_BY]->(author:Author)\n",
    "RETURN book.title AS BookTitle,\n",
    "       genre.name AS BookGenre,\n",
    "       author.name AS AuthorName,\n",
    "       ROUND(100 * (COALESCE(book.likeability, 0) + COALESCE(genre.likeability, 0) + COALESCE(author.likeability, 0))) / 100 AS TotalLikeabilityScore\n",
    "ORDER BY TotalLikeabilityScore DESC\n",
    "\"\"\"\n",
    ")[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_random_user_name():\n",
    "        result = db.cypher_query(\"\"\"\n",
    "            MATCH (user:User)\n",
    "            WITH COLLECT(user.name) AS names\n",
    "            RETURN apoc.coll.randomItem(names) AS RandomUserName\n",
    "        \"\"\")\n",
    "        return result[0][0][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Rekommendation for user:\n",
    "\n",
    "USER_NAME = 'Hasten Koefoed'\n",
    "\n",
    "USER_NAME = get_random_user_name()\n",
    "MATCH (user:User {{name: '{USER_NAME}'}})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "'Helgha Madsen'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "query_string = f\"\"\"\n",
    "MATCH (user:User {{name: '{USER_NAME}'}})\n",
    "WITH user, \n",
    "     apoc.convert.fromJsonList(user.authorLikeRatios) AS authorRatiosList,\n",
    "     apoc.convert.fromJsonList(user.genreLikeRatios) AS genreRatiosList\n",
    "\n",
    "UNWIND authorRatiosList as authorRatios\n",
    "UNWIND genreRatiosList as genreRatios\n",
    "\n",
    "MATCH (book:Book)-[:BELONGS_TO]->(genre:Genre)\n",
    "MATCH (book)-[:WRITTEN_BY]->(author:Author)\n",
    "WHERE NOT (user)-[:READ]->(book)\n",
    "WITH book, \n",
    "     genre, \n",
    "     author, \n",
    "     CASE WHEN author.name = authorRatios.author THEN authorRatios.likeRatio ELSE 1 END AS authorLikeRatio,\n",
    "     CASE WHEN genre.name = genreRatios.genre THEN genreRatios.likeRatio ELSE 1 END AS genreLikeRatio\n",
    "RETURN book.title AS BookTitle,\n",
    "       genre.name AS BookGenre,\n",
    "       author.name AS AuthorName,\n",
    "       ROUND(100 * (COALESCE(book.likeability, 0) + COALESCE(genre.likeability, 0) * genreLikeRatio + COALESCE(author.likeability, 0) * authorLikeRatio)) / 100 AS TotalLikeabilityScore\n",
    "ORDER BY TotalLikeabilityScore DESC\n",
    "\"\"\"\n",
    "\n",
    "# Execute the query\n",
    "user_data = db.cypher_query(query_string)[0]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_string = f\"\"\"\n",
    "MATCH (user:User {{name: '{USER_NAME}'}})\n",
    "OPTIONAL MATCH (user)-[:READ]->(book:Book)\n",
    "RETURN user.authorLikeRatios, user.genreLikeRatios, COLLECT(book.title) AS ReadBooks\n",
    "\"\"\"\n",
    "\n",
    "# Execute the query\n",
    "results = db.cypher_query(query_string)[0][0]\n",
    "print(\"Author Like Ratios:\", results[0])\n",
    "print(\"Genre Like Ratios:\", results[1])\n",
    "print(\"Books Read by User:\", results[2])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.DataFrame(data, columns=['BookTitle', 'Genre', 'Author', 'Score'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "df_user = pd.DataFrame(user_data, columns=['BookTitle', 'Genre', 'Author', 'Score_user'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Merging the dataframes on 'BookTitle', 'Genre', and 'Author'\n",
    "merged_df = df.merge(df_user, on=['BookTitle', 'Genre', 'Author'])\n",
    "\n",
    "# Assuming merged_df is your merged DataFrame\n",
    "sorted_df = merged_df.sort_values(by='Score_user', ascending=False)\n",
    "\n",
    "sorted_df.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "hive-SFGWpxVe-py3.10",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
