{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from pathlib import Path\n",
    "from zipfile import ZipFile\n",
    "\n",
    "from mimesis import Person\n",
    "from mimesis.locales import Locale\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "DUMMY_DATA_DIR = Path(\"assets/dummy_data\")\n",
    "\n",
    "BOOK_TABEL_FILENAME = \"books_df.csv\"\n",
    "\n",
    "USER_TABEL_FILENAME = \"users_df.csv\"\n",
    "\n",
    "RATING_TABEL_FILNAME = \"ratings_df.csv\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "DATA_DIR = Path(\"assets/books.zip\")\n",
    "\n",
    "with ZipFile(DATA_DIR) as z:\n",
    "    files = (file for file in z.namelist() if Path(file).suffix == \".csv\")\n",
    "    data = {Path(file).stem.lower(): pd.read_csv(z.extract(file),low_memory=False) for file in files}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_3511/63794686.py:27: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_ratings_df.loc[:, 'Rating_cat'] = rating_cat\n",
      "/tmp/ipykernel_3511/63794686.py:59: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_users_df.loc[:, 'User-Name'] = filtered_users_df[\"User-ID\"].map(id_to_name)\n",
      "/tmp/ipykernel_3511/63794686.py:60: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_users_df.loc[:, 'AgeGroup'] = age_group\n",
      "/tmp/ipykernel_3511/63794686.py:27: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  filtered_ratings_df.loc[:, 'Rating_cat'] = rating_cat\n"
     ]
    }
   ],
   "source": [
    "def generate_names(unique_ids: set[str]) -> dict[str, str]:\n",
    "    \n",
    "    \"\"\"Generate Fake Names matching unique ids\n",
    "    \"\"\"\n",
    "\n",
    "    number_of_ids = len(unique_ids)\n",
    "    person = Person(Locale.DA)\n",
    "    unique_names = set()\n",
    "\n",
    "    # Generate the specified number of female names\n",
    "    while len(unique_names) < number_of_ids:\n",
    "        name = person.full_name()\n",
    "        unique_names.add(name)\n",
    "\n",
    "    return {id:name for id, name in zip(unique_ids, unique_names)}\n",
    "\n",
    "\n",
    "def filter_ratings(data, num_samples=10, random_state=40):\n",
    "    ratings_df = data['ratings']\n",
    "    books_list = ratings_df.sample(num_samples, random_state=random_state).ISBN.to_list()\n",
    "    filtered_ratings_df = ratings_df[ratings_df['ISBN'].isin(books_list)]\n",
    "\n",
    "    bins = [0, 5, 10]\n",
    "    labels = [\"Did Not Like\", 'Liked']\n",
    "    rating_cat = pd.cut(filtered_ratings_df[\"Book-Rating\"], bins=bins, labels=labels, right=False)\n",
    "\n",
    "    filtered_ratings_df.loc[:, 'Rating_cat'] = rating_cat\n",
    "    filtered_ratings_df.to_csv(f\"{DUMMY_DATA_DIR}/{RATING_TABEL_FILNAME}\", index=False)\n",
    "    return filtered_ratings_df\n",
    "\n",
    "def generate_name_mapping(unique_ids):\n",
    "    id_to_name = generate_names(unique_ids=unique_ids)\n",
    "    return id_to_name\n",
    "\n",
    "def generate_random_numbers_and_age_groups(size):\n",
    "    np.random.seed(0)\n",
    "    random_numbers = np.random.normal(loc=50, scale=20, size=size)\n",
    "    random_numbers = np.clip(random_numbers, 8, 90)\n",
    "\n",
    "    bins = [0, 11, 18, 25, 55, 110]\n",
    "    labels = ['Kid', 'Teen', 'Young Adult', 'Adult', 'Old Person']\n",
    "    age_group = pd.cut(random_numbers, bins=bins, labels=labels, right=False)\n",
    "    age = random_numbers.round()\n",
    "\n",
    "    return age_group, age\n",
    "\n",
    "def generate_user_data(data):\n",
    "    users_df = data[\"users\"]\n",
    "    ratings_df = filter_ratings(data)\n",
    "    users_list = ratings_df[\"User-ID\"].to_list()\n",
    "\n",
    "    filtered_users_df = users_df[users_df[\"User-ID\"].isin(users_list)]\n",
    "\n",
    "    unique_ids = filtered_users_df[\"User-ID\"].unique()\n",
    "    id_to_name = generate_name_mapping(unique_ids)\n",
    "\n",
    "    age_group, age = generate_random_numbers_and_age_groups(len(filtered_users_df))\n",
    "\n",
    "    filtered_users_df.loc[:, 'User-Name'] = filtered_users_df[\"User-ID\"].map(id_to_name)\n",
    "    filtered_users_df.loc[:, 'AgeGroup'] = age_group\n",
    "    filtered_users_df.loc[:, 'Age'] = age\n",
    "\n",
    "    filtered_users_df.to_csv(f\"{DUMMY_DATA_DIR}/{USER_TABEL_FILENAME}\", index=False)\n",
    "    return filtered_users_df\n",
    "\n",
    "def process_books_data(data, preprocessed_users_df):\n",
    "    books_df = data[\"books\"][['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher']]\n",
    "    filtered_ratings_df = filter_ratings(data)\n",
    "    books_df = books_df[books_df['ISBN'].isin(filtered_ratings_df[\"ISBN\"].tolist())]\n",
    "    \n",
    "    # Define a list of genres\n",
    "    genres = ['Mystery', 'Science Fiction', 'Romance', 'Fantasy', 'Thriller']\n",
    "    \n",
    "    # Add a 'Genre' column with randomly assigned genres\n",
    "    books_df['Genre'] = np.random.choice(genres, size=len(books_df))\n",
    "    books_df.to_csv(f\"{DUMMY_DATA_DIR}/{BOOK_TABEL_FILENAME}\", index=False)\n",
    "    return books_df\n",
    "\n",
    "filtered_users_df = generate_user_data(data)\n",
    "processed_books_df = process_books_data(data, filtered_users_df)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "import duckdb\n",
    "\n",
    "key_1 = \"ISBN\"\n",
    "key_2 = \"User-ID\"\n",
    "\n",
    "# Create a new table and insert the results of the JOIN query into it\n",
    "duckdb.sql(\n",
    "    f\"\"\"\n",
    "    CREATE TABLE joined_table AS\n",
    "    SELECT *\n",
    "    FROM \"{DUMMY_DATA_DIR}/{RATING_TABEL_FILNAME}\" AS ratings\n",
    "    JOIN \"{DUMMY_DATA_DIR}/{BOOK_TABEL_FILENAME}\" AS books ON (books.{key_1} = ratings.{key_1})\n",
    "    JOIN \"{DUMMY_DATA_DIR}/{USER_TABEL_FILENAME}\" AS users ON (users.\"{key_2}\" = ratings.\"{key_2}\")\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',\n",
       "       'Genre', 'User-ID', 'User-Name', 'Book-Rating', 'Rating_cat',\n",
       "       'Location', 'Age', 'AgeGroup'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Select the data from the newly created table\n",
    "dataf = duckdb.sql(\n",
    "    \"\"\"\n",
    "    SELECT ISBN, \"Book-Title\", \"Book-Author\", \"Year-Of-Publication\", Publisher, Genre, \"User-ID\", \"User-Name\",\n",
    "            \"Book-Rating\", \"Rating_cat\" ,Location, Age, AgeGroup\n",
    "    FROM joined_table\n",
    "    \"\"\"\n",
    ").df().sample(100)\n",
    "dataf.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from ast import literal_eval\n",
    "import json\n",
    "# from decouple import config \".py\n",
    "from decouple import AutoConfig # notebooks\n",
    "import duckdb\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "from mimesis import Person\n",
    "from mimesis.locales import Locale\n",
    "\n",
    "from neomodel import (config as cf,\n",
    "                      db,\n",
    "                      StructuredNode,\n",
    "                      StringProperty,\n",
    "                      StructuredRel,\n",
    "                      DateTimeProperty,\n",
    "                      RelationshipTo,\n",
    "                      RelationshipFrom,\n",
    "                      UniqueIdProperty,\n",
    "\n",
    "\n",
    ")\n",
    "\n",
    "from neomodel.contrib.spatial_properties import PointProperty, NeomodelPoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "cf.AUTO_INSTALL_LABELS = True\n",
    "cf.ENCRYPTED_CONNECTION = False\n",
    "\n",
    "#NEO4J_BOLT_URL=\"bolt://neo4j:metterocks@localhost:7687\"\n",
    "db.set_connection(\"bolt://neo4j:metterocks@localhost:7687\")\n",
    "\n",
    "db._NODE_CLASS_REGISTRY\n",
    "db._NODE_CLASS_REGISTRY = {}\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], [])"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#delete all nodes\n",
    "db.cypher_query(\n",
    "\"MATCH (n) DETACH DELETE n\"\n",
    ")\n",
    "\n",
    "#delete all nodes and relationships\n",
    "db.cypher_query(\n",
    "\"MATCH () <- [n] - () DELETE n\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " + Creating node unique constraint for title on label Book for class __main__.Book\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=18, name='constraint_unique_Book_title', type='UNIQUENESS', schema=(:Book {title}), ownedIndex=17 )'.}\n",
      " + Creating node unique constraint for isbn on label Book for class __main__.Book\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=10, name='constraint_unique_Book_isbn', type='UNIQUENESS', schema=(:Book {isbn}), ownedIndex=9 )'.}\n",
      " + Creating node unique constraint for uid on label User for class __main__.User\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=12, name='constraint_unique_User_uid', type='UNIQUENESS', schema=(:User {uid}), ownedIndex=11 )'.}\n",
      " + Creating node unique constraint for name on label Author for class __main__.Author\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=16, name='constraint_unique_Author_name', type='UNIQUENESS', schema=(:Author {name}), ownedIndex=15 )'.}\n",
      " + Creating node unique constraint for name on label Genre for class __main__.Genre\n",
      "{code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent constraint already exists, 'Constraint( id=20, name='constraint_unique_Genre_name', type='UNIQUENESS', schema=(:Genre {name}), ownedIndex=19 )'.}\n"
     ]
    }
   ],
   "source": [
    "class Book(StructuredNode):\n",
    "    title = StringProperty(unique_index=True)\n",
    "    isbn = UniqueIdProperty()\n",
    "\n",
    "    written_by = RelationshipTo('Author', 'WRITTEN_BY')\n",
    "    belongs_to = RelationshipTo('Genre', 'BELONGS_TO')\n",
    "\n",
    "class AgeGroup(StructuredNode):\n",
    "    age = StringProperty(required=True)\n",
    "\n",
    "\n",
    "class User(StructuredNode):\n",
    "    uid = UniqueIdProperty()\n",
    "    name = StringProperty(required=True)\n",
    "\n",
    "\n",
    "    read = RelationshipTo('Book', 'READ')\n",
    "    is_in = RelationshipTo('AgeGroup', 'IS_IN')\n",
    "    liked = RelationshipTo('Book', 'LIKED')\n",
    "    hate = RelationshipTo('Book', 'HATE')\n",
    "\n",
    "\n",
    "class Author(StructuredNode):\n",
    "    name = StringProperty(unique_index=True)\n",
    "\n",
    "\n",
    "class Genre(StructuredNode):\n",
    "    name = StringProperty(unique_index=True)\n",
    "     \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# a = Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',\n",
    "#        'Genre', 'User-ID', 'Book-Rating', 'Location', 'Age', 'AgeGroup'],\n",
    "#       dtype='object')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# USERS\n",
    "for user_name, user_id in (dataf[[\"User-Name\", 'User-ID']]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "\n",
    "):\n",
    "    User(name=user_name, uid=user_id).save()\n",
    "\n",
    "# BOOKS\n",
    "for book_title, isbn in (dataf[[\"Book-Title\", \"ISBN\"]]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "\n",
    "):\n",
    "    Book(title=book_title, uid=isbn).save()\n",
    "\n",
    "# AUTHORS\n",
    "for book_author in (dataf[\"Book-Author\"]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "\n",
    "    Author(name=book_author).save()\n",
    "\n",
    "# AGEGROUPS\n",
    "for age_group in (dataf[\"AgeGroup\"]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "\n",
    "    AgeGroup(age=age_group).save()\n",
    "\n",
    "# Genres\n",
    "for genre in (dataf[\"Genre\"]\n",
    "                  .drop_duplicates().values.tolist()\n",
    "):\n",
    "\n",
    "    Genre(name=genre).save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "    \n",
    "for book, author, user, age_group, genre in dataf[[\"Book-Title\", \"Book-Author\", \"User-ID\", \"AgeGroup\", \"Genre\"]].drop_duplicates().values.tolist():\n",
    "    # Find all matching books and authors\n",
    "    books = Book.nodes.filter(title=book)\n",
    "    authors = Author.nodes.filter(name=author)\n",
    "    users = User.nodes.filter(uid=user)\n",
    "    ages = AgeGroup.nodes.filter(age=age_group)\n",
    "    genres = Genre.nodes.filter(name=genre)\n",
    "\n",
    "\n",
    "    for book_node in books:\n",
    "        for author_node in authors:\n",
    "            book_node.written_by.connect(author_node)\n",
    "        \n",
    "        for genre_node in genres:\n",
    "            book_node.belongs_to.connect(genre_node)\n",
    "    \n",
    "    for user_node in users:\n",
    "        for book_node in books:\n",
    "            user_node.read.connect(book_node)\n",
    "\n",
    "        for age_node in ages:\n",
    "            user_node.is_in.connect(age_node)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "liked_df = dataf[dataf.Rating_cat == \"Liked\"]\n",
    "\n",
    "for book, user in liked_df[[\"Book-Title\", \"User-ID\"]].drop_duplicates().values.tolist():\n",
    "\n",
    "    books = Book.nodes.filter(title=book)\n",
    "    user = User.nodes.filter(uid=user)\n",
    "\n",
    "    for user_node in user:\n",
    "        for book_node in books:\n",
    "            user_node.liked.connect(book_node)\n",
    "            \n",
    "not_df = dataf[dataf.Rating_cat == \"Did Not Like\"]\n",
    "\n",
    "for book, user in not_df[[\"Book-Title\", \"User-ID\"]].drop_duplicates().values.tolist():\n",
    "# Find all matching books and authors\n",
    "    books = Book.nodes.filter(title=book)\n",
    "    user = User.nodes.filter(uid=user)\n",
    "\n",
    "    for user_node in user:\n",
    "        for book_node in books:\n",
    "            user_node.hate.connect(book_node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([['Call of the Wild', 15, 37, 52, 0.27],\n",
       "  ['Trading Places', 4, 16, 20, 0.2],\n",
       "  ['Meditations for Women Who Do Too Much - 10th Anniversary', 3, 9, 12, 0.25],\n",
       "  ['How to Lose Friends &amp; Alienate People', 3, 4, 7, 0.43],\n",
       "  ['Nisa: The Life and Words of a !Kung Woman', 2, 2, 4, 0.5],\n",
       "  ['SAVAGES', 0, 2, 2, 0.0]],\n",
       " ['BookTitle', 'Likes', 'Hates', 'TotalReactions', 'LikeReadRatio'])"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set book likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH book, COUNT(DISTINCT like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH book, Likes, COUNT(DISTINCT hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH book, Likes, Hates, COUNT(DISTINCT read) AS Reads\n",
    "WITH book, Likes, Hates, Reads, \n",
    "     ROUND(100 * CASE WHEN Reads > 0 THEN toFloat(Likes) / Reads ELSE 0 END) / 100 AS LikeReadRatio\n",
    "SET book.likeability = LikeReadRatio\n",
    "RETURN book.title AS BookTitle, \n",
    "       Likes, \n",
    "       Hates, \n",
    "       (Likes + Hates) AS TotalReactions,\n",
    "       LikeReadRatio\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([['Mystery', 0, 2, 2, 0.0],\n",
       "  ['Romance', 7, 25, 32, 0.22],\n",
       "  ['Science Fiction', 2, 2, 4, 0.5],\n",
       "  ['Thriller', 18, 41, 62, 0.29]],\n",
       " ['Genre', 'TotalLikes', 'TotalHates', 'TotalReads', 'LikeReadRatio'])"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set genre likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (genre:Genre)<-[:BELONGS_TO]-(book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH genre, book, COUNT(like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH genre, book, Likes, COUNT(hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH genre, book, Likes, Hates, COUNT(read) AS Reads\n",
    "WITH genre, COLLECT({book: book.title, likes: Likes, hates: Hates, reads: Reads}) AS Books\n",
    "UNWIND Books AS bookDetails\n",
    "WITH genre, \n",
    "     SUM(bookDetails.likes) AS TotalLikes, \n",
    "     SUM(bookDetails.hates) AS TotalHates,\n",
    "     SUM(bookDetails.reads) AS TotalReads\n",
    "WITH genre, TotalLikes, TotalHates, TotalReads,\n",
    "     CASE WHEN TotalReads > 0 THEN ROUND(100 * toFloat(TotalLikes) / TotalReads) / 100 ELSE 0 END AS LikeReadRatio\n",
    "SET genre.likeability = LikeReadRatio\n",
    "RETURN genre.name AS Genre, \n",
    "       TotalLikes, \n",
    "       TotalHates,\n",
    "       TotalReads,\n",
    "       LikeReadRatio\n",
    "ORDER BY genre.name\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([['Anne Wilson Schaef', 3, 9, 12, 0.25],\n",
       "  ['Fern Michaels', 4, 16, 20, 0.2],\n",
       "  ['Jack London', 15, 37, 55, 0.27],\n",
       "  ['Majorie Shostak', 2, 2, 4, 0.5],\n",
       "  ['Shirley Conran', 0, 2, 2, 0.0],\n",
       "  ['Toby Young', 3, 4, 7, 0.43]],\n",
       " ['AuthorName', 'TotalLikes', 'TotalHates', 'TotalReads', 'LikeReadRatio'])"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set author likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (author:Author)<-[:WRITTEN_BY]-(book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH author, book, COUNT(DISTINCT like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH author, book, Likes, COUNT(DISTINCT hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH author, book, Likes, Hates, COUNT(DISTINCT read) AS Reads\n",
    "WITH author, SUM(Likes) AS TotalLikes, SUM(Hates) AS TotalHates, SUM(Reads) AS TotalReads\n",
    "WITH author, TotalLikes, TotalHates, TotalReads,\n",
    "     CASE WHEN TotalReads > 0 THEN ROUND(100 * toFloat(TotalLikes) / TotalReads) / 100 ELSE 0 END AS LikeReadRatio\n",
    "SET author.likeability = LikeReadRatio\n",
    "RETURN author.name AS AuthorName, \n",
    "       TotalLikes, \n",
    "       TotalHates,\n",
    "       TotalReads,\n",
    "       LikeReadRatio\n",
    "ORDER BY author.name\n",
    "\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([['Call of the Wild', 15, 37, 52, 0.27],\n",
       "  ['Trading Places', 4, 16, 20, 0.2],\n",
       "  ['Meditations for Women Who Do Too Much - 10th Anniversary', 3, 9, 12, 0.25],\n",
       "  ['How to Lose Friends &amp; Alienate People', 3, 4, 7, 0.43],\n",
       "  ['Nisa: The Life and Words of a !Kung Woman', 2, 2, 4, 0.5],\n",
       "  ['SAVAGES', 0, 2, 2, 0.0]],\n",
       " ['BookTitle', 'Likes', 'Hates', 'TotalReactions', 'LikeReadRatio'])"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set book likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (book:Book)\n",
    "OPTIONAL MATCH (book)<-[like:LIKED]-(:User)\n",
    "WITH book, COUNT(DISTINCT like) AS Likes\n",
    "OPTIONAL MATCH (book)<-[hate:HATE]-(:User)\n",
    "WITH book, Likes, COUNT(DISTINCT hate) AS Hates\n",
    "OPTIONAL MATCH (book)<-[read:READ]-(:User)\n",
    "WITH book, Likes, Hates, COUNT(DISTINCT read) AS Reads\n",
    "WITH book, Likes, Hates, Reads, \n",
    "     ROUND(100 * CASE WHEN Reads > 0 THEN toFloat(Likes) / Reads ELSE 0 END) / 100 AS LikeReadRatio\n",
    "SET book.likeability = LikeReadRatio\n",
    "RETURN book.title AS BookTitle, \n",
    "       Likes, \n",
    "       Hates, \n",
    "       (Likes + Hates) AS TotalReactions,\n",
    "       LikeReadRatio\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], [])"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set UserAuthor likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (user:User)-[:READ]->(book)-[:WRITTEN_BY]->(author:Author)\n",
    "OPTIONAL MATCH (user)-[like:LIKED]->(book)\n",
    "OPTIONAL MATCH (user)-[hate:HATE]->(book)\n",
    "WITH user, author, \n",
    "     COUNT(DISTINCT like) AS Likes, \n",
    "     COUNT(DISTINCT hate) AS Hates\n",
    "WITH user, \n",
    "     COLLECT({author: author.name, likeRatio: CASE WHEN (Likes + Hates) > 0 THEN ROUND(100 * toFloat(Likes) / (Likes + Hates)) / 100 ELSE 0 END}) AS AuthorLikeRatios\n",
    "SET user.authorLikeRatios = apoc.convert.toJson(AuthorLikeRatios)\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], [])"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set UserGenre likeability propperty\n",
    "\n",
    "db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (user:User)-[:READ]->(book)-[:BELONGS_TO]->(genre:Genre)\n",
    "OPTIONAL MATCH (user)-[like:LIKED]->(book)\n",
    "OPTIONAL MATCH (user)-[hate:HATE]->(book)\n",
    "WITH user, genre, \n",
    "     COUNT(DISTINCT like) AS Likes, \n",
    "     COUNT(DISTINCT hate) AS Hates\n",
    "WITH user, \n",
    "     COLLECT({genre: genre.name, likeRatio: CASE WHEN (Likes + Hates) > 0 THEN ROUND(100 * toFloat(Likes) / (Likes + Hates)) / 100 ELSE 0 END}) AS GenreLikeRatios\n",
    "SET user.genreLikeRatios = apoc.convert.toJson(GenreLikeRatios)\n",
    "\"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "# bookscore for new user\n",
    "\n",
    "data = db.cypher_query(\n",
    "\"\"\"\n",
    "MATCH (book:Book)-[:BELONGS_TO]->(genre:Genre)\n",
    "MATCH (book)-[:WRITTEN_BY]->(author:Author)\n",
    "RETURN book.title AS BookTitle,\n",
    "       genre.name AS BookGenre,\n",
    "       author.name AS AuthorName,\n",
    "       ROUND(100 * (COALESCE(book.likeability, 0) + COALESCE(genre.likeability, 0) + COALESCE(author.likeability, 0))) / 100 AS TotalLikeabilityScore\n",
    "ORDER BY TotalLikeabilityScore DESC\n",
    "\"\"\"\n",
    ")[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>BookTitle</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Author</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nisa: The Life and Words of a !Kung Woman</td>\n",
       "      <td>Science Fiction</td>\n",
       "      <td>Majorie Shostak</td>\n",
       "      <td>1.50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How to Lose Friends &amp;amp; Alienate People</td>\n",
       "      <td>Thriller</td>\n",
       "      <td>Toby Young</td>\n",
       "      <td>1.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Call of the Wild</td>\n",
       "      <td>Thriller</td>\n",
       "      <td>Jack London</td>\n",
       "      <td>0.83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Meditations for Women Who Do Too Much - 10th A...</td>\n",
       "      <td>Romance</td>\n",
       "      <td>Anne Wilson Schaef</td>\n",
       "      <td>0.72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Trading Places</td>\n",
       "      <td>Romance</td>\n",
       "      <td>Fern Michaels</td>\n",
       "      <td>0.62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>SAVAGES</td>\n",
       "      <td>Mystery</td>\n",
       "      <td>Shirley Conran</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           BookTitle            Genre  \\\n",
       "0          Nisa: The Life and Words of a !Kung Woman  Science Fiction   \n",
       "1          How to Lose Friends &amp; Alienate People         Thriller   \n",
       "2                                   Call of the Wild         Thriller   \n",
       "3  Meditations for Women Who Do Too Much - 10th A...          Romance   \n",
       "4                                     Trading Places          Romance   \n",
       "5                                            SAVAGES          Mystery   \n",
       "\n",
       "               Author  Score  \n",
       "0     Majorie Shostak   1.50  \n",
       "1          Toby Young   1.15  \n",
       "2         Jack London   0.83  \n",
       "3  Anne Wilson Schaef   0.72  \n",
       "4       Fern Michaels   0.62  \n",
       "5      Shirley Conran   0.00  "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "df = pd.DataFrame(data, columns=['BookTitle', 'Genre', 'Author', 'Score'])\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_random_user_name():\n",
    "        result = db.cypher_query(\"\"\"\n",
    "            MATCH (user:User)\n",
    "            WITH COLLECT(user.name) AS names\n",
    "            RETURN apoc.coll.randomItem(names) AS RandomUserName\n",
    "        \"\"\")\n",
    "        return result[0][0][0]\n",
    "\n",
    "random_user_name = get_random_user_name()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Rekommendation for user:\n",
    "\n",
    "USER_NAME = 'Dorethe Nørgård'\n",
    "\n",
    "USER_NAME = random_user_name\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "query_string = f\"\"\"\n",
    "MATCH (user:User {{name: '{USER_NAME}'}})\n",
    "WITH user, \n",
    "     apoc.convert.fromJsonList(user.authorLikeRatios) AS authorRatiosList,\n",
    "     apoc.convert.fromJsonList(user.genreLikeRatios) AS genreRatiosList\n",
    "\n",
    "UNWIND authorRatiosList as authorRatios\n",
    "UNWIND genreRatiosList as genreRatios\n",
    "\n",
    "MATCH (book:Book)-[:BELONGS_TO]->(genre:Genre)\n",
    "MATCH (book)-[:WRITTEN_BY]->(author:Author)\n",
    "WHERE NOT (user)-[:READ]->(book)\n",
    "WITH book, \n",
    "     genre, \n",
    "     author, \n",
    "     CASE WHEN author.name = authorRatios.author THEN authorRatios.likeRatio ELSE 1 END AS authorLikeRatio,\n",
    "     CASE WHEN genre.name = genreRatios.genre THEN genreRatios.likeRatio ELSE 1 END AS genreLikeRatio\n",
    "RETURN book.title AS BookTitle,\n",
    "       genre.name AS BookGenre,\n",
    "       author.name AS AuthorName,\n",
    "       ROUND(100 * (COALESCE(book.likeability, 0) + COALESCE(genre.likeability, 0) * genreLikeRatio + COALESCE(author.likeability, 0) * authorLikeRatio)) / 100 AS TotalLikeabilityScore\n",
    "ORDER BY TotalLikeabilityScore DESC\n",
    "\"\"\"\n",
    "\n",
    "# Execute the query\n",
    "user_data = db.cypher_query(query_string)[0]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>BookTitle</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Author</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nisa: The Life and Words of a !Kung Woman</td>\n",
       "      <td>Science Fiction</td>\n",
       "      <td>Majorie Shostak</td>\n",
       "      <td>1.50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Meditations for Women Who Do Too Much - 10th A...</td>\n",
       "      <td>Romance</td>\n",
       "      <td>Anne Wilson Schaef</td>\n",
       "      <td>0.72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Trading Places</td>\n",
       "      <td>Romance</td>\n",
       "      <td>Fern Michaels</td>\n",
       "      <td>0.62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Call of the Wild</td>\n",
       "      <td>Thriller</td>\n",
       "      <td>Jack London</td>\n",
       "      <td>0.54</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SAVAGES</td>\n",
       "      <td>Mystery</td>\n",
       "      <td>Shirley Conran</td>\n",
       "      <td>0.00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           BookTitle            Genre  \\\n",
       "0          Nisa: The Life and Words of a !Kung Woman  Science Fiction   \n",
       "1  Meditations for Women Who Do Too Much - 10th A...          Romance   \n",
       "2                                     Trading Places          Romance   \n",
       "3                                   Call of the Wild         Thriller   \n",
       "4                                            SAVAGES          Mystery   \n",
       "\n",
       "               Author  Score  \n",
       "0     Majorie Shostak   1.50  \n",
       "1  Anne Wilson Schaef   0.72  \n",
       "2       Fern Michaels   0.62  \n",
       "3         Jack London   0.54  \n",
       "4      Shirley Conran   0.00  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a DataFrame\n",
    "df = pd.DataFrame(user_data, columns=['BookTitle', 'Genre', 'Author', 'Score'])\n",
    "df\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "hive-SFGWpxVe-py3.10",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
